"STORE_DESCRIPTION" = "VLC යනු නිදහස් සහ විවෘත කේත හරස් වේදිකා බහුමාධ්‍ය වාදකයකි.\nඑයට පරිවර්තනයකින් තොරව ඔබේ සියලුම චිත්‍රපට, සංදර්ශන සහ සංගීතය බොහෝ ආකෘතිවලින් වාදනය කළ හැක.\nඑය Dropbox, GDrive, OneDrive, Box, iCloud Drive, iTunes, සෘජු බාගත කිරීම් සහ Wi-Fi බෙදාගැනීම් හරහා මෙන්ම SMB, FTP, SFTP, NFS, UPnP/DLNA මාධ්‍ය සේවාදායකයන් සමඟින් ගොනු සමමුහුර්තකරණයට සහ වෙබ්.\nVLC සම්පූර්ණ SSA ගැළපුම, බහු ධාවන ශ්‍රව්‍ය, ධාවන වේග පාලනය සහ Chromecast හරහා විදැහුම්කරණය ඇතුළු උසස් උපසිරැසි සඳහා සහය ලබා දෙයි.\n\nVLC සම්පූර්ණයෙන්ම නොමිලේ සහ විවෘත මූලාශ්‍ර වේ.";

"STORE_DESCRIPTION_TV" = "VLC යනු නිදහස් සහ විවෘත කේත හරස් වේදිකා බහුමාධ්‍ය වාදකයකි.\nඑයට පරිවර්තනයකින් තොරව ඔබේ සියලුම චිත්‍රපට, සංදර්ශන සහ සංගීතය බොහෝ ආකෘතිවලින් වාදනය කළ හැක.\nඑය ඔබගේ Mac හෝ PC වෙතින් Web UI හරහා දුරස්ථ ධාවනයට මෙන්ම SMB, FTP, SFTP, NFS, UPnP/DLNA මාධ්‍ය සේවාදායකයන් සහ වෙබයෙන් ප්‍රවාහ කිරීමට ඉඩ සලසයි.\nVLC සම්පූර්ණ SSA ගැළපුම, බහු-පථ ශ්‍රව්‍ය සහ ධාවන වේග පාලනය ඇතුළු උසස් උපසිරැසි සඳහා සහය ලබා දෙයි.\n\nVLC සම්පූර්ණයෙන්ම නොමිලේ සහ විවෘත මූලාශ්‍ර වේ.\n\nකලා කෘති සපයනු ලබන්නේ TMDb විසිනි, එය ප්‍රජාව විසින් පවත්වාගෙන යනු ලබන චිත්‍රපට දත්ත ගබඩාවක් වේ.";

"UNKNOWN_TRACK_TYPE" = "නොදන්නා ධාවන පථ වර්ගය";
"CHOOSE_TITLE" = "මාතෘකාව තෝරන්න";
"CHOOSE_CHAPTER" = "පරිච්ඡේදය තෝරන්න";
"CHAPTER_SELECTION_TITLE" = "පරිච්ඡේද";
"TITLE" = "ශීර්ෂය";
"CHAPTER" = "පරිච්ඡේදය";
"TRACK_SELECTION" = "ධාවන පථ තේරීම";
"AUDIO" = "ශ්රව්ය උපකරණ";
"SUBTITLES" = "උපසිරැසි";
"LANGUAGE" = "භාෂාව";
"MEDIA_INFO" = "මාධ්ය තොරතුරු";
"VIDEO_DIMENSIONS" = "වීඩියෝ මානයන්";
"FORMAT_VIDEO_DIMENSIONS" = "%ix%i පික්සල";
"FORMAT_AUDIO_TRACKS" = "%i ශ්‍රව්‍ය පීලි";
"ONE_AUDIO_TRACK" = "එක් ශ්‍රව්‍ය පථයක්";
"FORMAT_SPU_TRACKS" = "%i උපසිරැසි ඛණ්ඩ";
"ONE_SPU_TRACK" = "එක් උපසිරැසි ධාවන පථයක්";
"TRACKS" = "%i පීලි";
"TRACK" = "%i ධාවන පථය";
"TRACKS_DURATION" = "%u පීලි, කාලසීමාව: %@";
"NB_ALBUM_FORMAT" = "%i ඇල්බමය";
"NB_ALBUMS_FORMAT" = "%i ඇල්බම";

"PLAYING_EXTERNALLY_TITLE" = "රුපවාහිනිය සම්බන්ධ කෙරුණි";
"PLAYING_EXTERNALLY_DESC" = "මෙම වීඩියෝව රුපවාහිනිය මත වාදනය වේ";
"PLAYING_EXTERNALLY_ADDITION" = "\n දැන් වාදනය වන්නේ:"; /* \n should stay in every translation */

"VFILTER_HUE" = "පැහැය";
"VFILTER_CONTRAST" = "අසමතාවය";
"VFILTER_BRIGHTNESS" = "දීප්තිය";
"VFILTER_SATURATION" = "සන්තෘප්තිය";
"VFILTER_GAMMA" = "ගැමා";

"PRESET_PREAMP_SETTING" = "පෙරසැකසුම් / පෙරසැකසුම් සැකසුම්";
"PREAMP" = "පූර්වාරම්භය";
"SNAP_BANDS" = "ස්නැප් බෑන්ඩ්ස්";

"PLAYBACK_FAILED" = "පිළිවැයිම අසාර්ථකයි";
"PLEASE_WAIT" = "කරුණාකර රැඳී සිටින්න";
"AR_CHANGED" = "දර්ශන අනුපාතය: %@";
"DEFAULT" = "පෙරනිමි ";
"FILL_TO_SCREEN" = "තිරය පිරවීමට කප්පාදු කරන්න";
"PLAYBACK_SPEED" = "පිළිවැයිම් වේගය";
"SPU_DELAY" = "උපසිරැසි ප්‍රමාදයි";
"AUDIO_DELAY" = "ශ්‍රව්‍ය ප්‍රමාදය";
"BUTTON_SLEEP_TIMER" = "Sleep Timer";
"SLEEP_TIMER_UPDATED" = "Sleep Timer යාවත්කාලීන කරන ලදී";
"CONTINUE_PLAYBACK" = "නැවත ධාවනය කරගෙන යන්නද?";
"CONTINUE_PLAYBACK_LONG" = "ඔබ නතර කළ තැනින් \"%@\" නැවත ධාවනය කිරීමට ඔබ කැමතිද?";

"BUTTON_ABOUT" = "ගැන";
"BUTTON_BACK" = "ආපසු";
"BUTTON_DONE" = "ඉවරයි";
"BUTTON_CANCEL" = "අත් හරින්න";
"BUTTON_SAVE" = "සුරකින්න";
"BUTTON_DOWNLOAD" = "බාගන්න";
"BUTTON_DELETE" = "මකන්න";
"BUTTON_OK" = "හරි";
"BUTTON_DISMISS" = "Dismiss";
"BUTTON_CONTACT" = "අපව අමතන්න";
"BUTTON_CONNECT" = "සම්බන්ධ කරන්න";
"BUTTON_RENAME" = "ප්‍රතිනම් කරන්න";
"BUTTON_LEARN_MORE" = "තවත් දැනගන්න";
"BUTTON_LOGOUT" = "පිටවීම";
"BUTTON_CONTINUE" = "දිගටම කරගෙන යන්න";
"BUTTON_SET" = "සකසන්න";
"BUTTON_RESET" = "යළි පිහිටුවන්න";
"BUTTON_RESCAN" = "නැවත ස්කෑන් කරන්න";
"PRIVATE_PLAYBACK_TOGGLE" = "පුද්ගලික පිළිවැයීම";
"SCAN_SUBTITLE_TOGGLE" = "උපසිරැසි සඳහා පරිලෝකනය කරන්න (http-පමණක්)";

"BUTTON_RENDERER" = "වාත්තු උපාංග";
"BUTTON_RENDERER_HINT" = "පවතින වාත්තු උපාංග මෙනුවක් පෙන්වන්න";
"BUTTON_AIRPLAY" = "AirPlay හෝ Bluetooth";
"BUTTON_AIRPLAY_HINT" = "පවතින AirPlay හෝ Bluetooth උපාංගවල මෙනුවක් පෙන්වන්න";

"UPGRADING_LIBRARY" = "මාධ්‍ය පුස්තකාලය උසස් කරමින්";

"FAVORITES" = "ප්රියතම";
"NO_FAVORITES" = "තවමත් ප්‍රියතමයන් නොමැත";
"NO_FAVORITES_DESCRIPTION" = "ඔබේ ප්‍රියතම ෆෝල්ඩර මෙහි ලැයිස්තුගත කිරීමට සේවාදායකයන් පිරික්සීමේදී ඒවා සලකුණු කරන්න.";
"ADD_FAVORITE" = "Add to Favorites";
"REMOVE_FAVORITE" = "Remove from Favorites";
"FAVORITE_ALERT_TITLE" = "Would you like to add this folder to your Favorites?";
"UNFAVORITE_ALERT_TITLE" = "Would you like to remove this folder from your Favorites?";

"OPEN_NETWORK" = "ජාල දහරාව විවෘත කරන්න";
"NETWORK_TITLE" = "ජාල දහරාව";
"OPEN_NETWORK_HELP" = "දහරාවක් කෙලින්ම විවෘත කිරීමට ඕනෑම HTTP, RTSP, RTMP, MMS, FTP හෝ UDP/RTP ලිපිනයක් යොදන්න.";
"HTTP_UPLOAD_SERVER_OFF" = "අකර්මණ්‍ය සර්වරය";
"HTTP_UPLOAD_NO_CONNECTIVITY" = "සක්‍රිය Wi-Fi සම්බන්ධතාවයක් නොමැත";
"OPEN_STREAM_OR_DOWNLOAD" = "ඔබට මෙම URL වාදනය හෝ භාගත කිරීමට අවශ්‍ය ද?";
"ALWAYS_STREAM_URL" = "Always play URLs";
"SHARED_VLC_IOS_LIBRARY" = "iOS පුස්තකාලය සඳහා බෙදාගත් VLC";
"SMB_CIFS_FILE_SERVERS" = "ගොනු සේවාදායකයන් (SMB)";

"MANAGED_SERVERS" = "කළමනාකරණය කළා";

"SMB_CIFS_FILE_SERVERS_SHORT" = "SMB";

"HTTP_DOWNLOAD_CANCELLED" = "බාගැනීම පරිශීලක විසින් අවලංගු කරන ලදී";

"DOWNLOAD_FROM_HTTP" = "බාගැනීම්";
"ERROR_NUMBER" = "%i දෝෂය හටගැණුනි";
"DOWNLOAD_FAILED" = "බාගැනීම අසාර්ථකයි";
"FILE_NOT_SUPPORTED" = "ගොනු ආකෘතිය සහය නොදක්වයි";
"FILE_NOT_SUPPORTED_LONG" = "%@ විසින් භාවිත කරන ලද ගොනු ආකෘතිය iOS සඳහා VLC හි මෙම අනුවාදය මඟින් සහාය නොදක්වයි.";
"SCHEME_NOT_SUPPORTED" = "ලිපින පරිපාටිය සහය නොදක්වයි";
"SCHEME_NOT_SUPPORTED_LONG" = "(%@) ලිපින පරිපාටිය සහය නොදක්වයි. කරුණාකර HTTP, HTTPS හෝ FTP සමඟ ඇරඹෙන ලිපිනයක් පාවිච්චි කරන්න.";
"RENAME_MEDIA_TO" = "%@ සඳහා නව නමක් යොදන්න";

"FOLDER_EMPTY" = "හිස් ෆෝල්ඩරය";

"SHARING_ACTION_SHEET_TITLE_CHOOSE_FILE" = "විවෘත කිරීමට ගොනුවක් තෝරන්න:";
"SHARING_ACTIVITY_OPEN_IN_TITLE" = "විවෘත කරන්න...";
"SHARING_ERROR_NO_FILES" = "බෙදා ගැනීමට ගොනු කිසිවක් සොයා ගැනීමට නොහැකි විය";
"SHARING_ERROR_NO_APPLICATIONS" = "මෙම වර්ගයේ ගොනු විවෘත කිරීමට යෙදුම් කිසිවක් සොයා ගැනීමට නොහැකි විය";
"SHARING_SUCCESS_CAMERA_ROLL" = "ගොනුව කැමරා රෝල් වෙත සාර්ථකව සුරැකිණි";

"FAVORITEVC_DETAILTEXT" = "ඔබගේ ප්රියතම ෆෝල්ඩර බලන්න";
"STREAMVC_DETAILTEXT" = "බාගත කිරීමකින් තොරව ප්‍රවාහ සෘජුවම වාදනය කරන්න";
"DOWNLOADVC_DETAILTEXT" = "ඔබගේ උපාංගයට ගොනු කෙලින්ම බාගන්න";
"HEADER_TITLE_RENDERER" = "වාත්තු උපාංගයක් තෝරන්න";

"BROWSE" = "Browse";
"NETWORK" = "ජාල";
"LOCAL_NETWORK" = "පෙදෙසි ජාලය";
"CONNECT_TO_SERVER" = "සර්වරය වෙත සම්බන්ධ වන්න";
"FILE_SERVER" = "ගොනු සේවාදායකයන්";
"USER_LABEL" = "පරිශීලක";
"PASSWORD_LABEL" = "මුරපදය";
"DISABLE_LABEL" = "අක්රිය කරන්න";
"BUTTON_ANONYMOUS_LOGIN" = "නිර්නාමික පිවිසුම";

"LOCAL_SERVER_REFRESH" = "යළි ප්‍රාණවත් කරන්න";
"LOCAL_SERVER_LAST_UPDATE" = "අවසන් වරට යාවත්කාලීන කලේ %@";
"LOCAL_SERVER_CONNECTION_FAILED_TITLE" = "සර්වර් සබඳතාවය අසාර්ථකයි";
"LOCAL_SERVER_CONNECTION_FAILED_MESSAGE" = "කරුණාකර ඔබේ සර්වරයේ ලිපිනය සහ අක්ත පත්‍ර පරික්ෂා කරන්න";

"FILES_APP_CELL_TITLE" = "දේශීය ගොනු";
"FILES_APP_CELL_SUBTITLE" = "VLC වෙත පිටපත් නොකර ගොනුවක් විවෘත කරන්න";

"CLOUD_SERVICES" = "වලාකුළු සේවා";
"LOGIN" = "ඇතුල් වන්න";
"LOGGED_IN" = "ලොග් වී ඇත";
"LOGGED_IN_SERVICES" = "%d ලොග් වී ඇති සේවාවන්";
"LOGGED_IN_SERVICE" = "1 සේවයට ඇතුළු වී ඇත";

"DROPBOX_DOWNLOAD" = "ගොනුව බාගන්නවද?";
"DROPBOX_DL_LONG" = "\"%@\" ඔබේ %@ වෙත බාගැනීමට කැමතිද?";
"DROPBOX_LOGIN" = "පිවිසුම";

"GDRIVE_ERROR_FETCHING_FILES" = "ගොනු පමුණුවීමේදී දෝෂයක් ඇති විය";
"GDRIVE_DOWNLOAD_SUCCESSFUL" = "ඔබේ ගොනුව සාර්ථකව බාගන්නා ලදී";
"GDRIVE_DOWNLOAD_SUCCESSFUL_TITLE" = "සාර්ථකයි";
"GDRIVE_ERROR_DOWNLOADING_FILE" = "බාගැනීමේදී දෝෂයක් හට ගැනුණි";
"GDRIVE_ERROR_DOWNLOADING_FILE_TITLE" = "දෝෂය";

"ONEDRIVE_MEDIA_WITHOUT_URL" = "තෝරාගත් මාධ්‍යයට වාදනය කළ හැකි url එකක් නොමැත";

"DISK_FULL" = "ගබඩා සීමාව ළඟා විය";
"DISK_FULL_FORMAT" = "%@ ඔබේ %@මත ගබඩා කළ නොහැක, මන්ද ඔබට ප්‍රමාණවත් නිදහස් ඉඩක් ඉතිරිව නැත.";

"NUM_OF_FILES" = "%i ගොනු";
"ONE_FILE" = "1 ගොනුව";
"NO_FILES" = "සහාය දක්වන ගොනු නොමැත";
"DOWNLOADING" = "බාගනිමින්...";
"REMAINING_TIME" = "ඉතිරි කාලය: %@";
"BIOMETRIC_UNLOCK" = "මාධ්‍ය පුස්තකාලය අගුළු හරින්න\nමුරකේතය ඇතුළු කිරීමට අවලංගු කරන්න";

// Passcode Strings that we need to localize for them
"Set Passcode" = "මුර කේතය සකසන්න";
"Enter Passcode" = "මුර කේතය ඇතුලත් කරන්න";
"Enter a passcode" = "මුර කේතයක් ඇතුලත් කරන්න";
"Enter your passcode" = "Enter your passcode";
"Passcodes did not match. Try again." = "මුරකේත නොගැලපේ. නැවත උත්සාහ කරන්න.";
"Re-enter your passcode" = "ඔබගේ මුර කේතය නැවත ඇතුලත් කරන්න";
"Passcode Options" = "Passcode Options";
"4-Digit Numeric Code" = "4-Digit Numeric Code"; /* Passcode 4 digit numeric code */
"6-Digit Numeric Code" = "6-Digit Numeric Code"; /* Passcode 6 digit numeric code */

"Settings" = "සැකසුම්"; // plain text key to keep compatibility with InAppSettingsKit's upstream
"ON" = "මත";
"OFF" = "අක්රියයි";

"EMPTY_LIBRARY" = "හිස් මාධ්‍ය පුස්තකාලය";
"EMPTY_LIBRARY_LONG" = "පසුධාවනය සඳහා, ඔබට iTunes, Wi-Fi උඩුගත කිරීම හෝ ක්ලවුඩ් සේවා භාවිතයෙන් ඔබේ ප්‍රාදේශීය ජාලයේ සේවාදායකයකින්, වලාකුළෙන් හෝ මාධ්‍ය ඔබේ උපාංගයට සමමුහුර්ත කළ හැක.";

"EMPTY_NO_PLAYLISTS" = "ධාවන ලැයිස්තු";
"EMPTY_NO_PLAYLISTS_DESCRIPTION" = "ධාවන ලැයිස්තු සෑදීමට, වීඩියෝ හෝ ශ්‍රව්‍ය අන්තර්ගත ටැබ් තුළ සංස්කරණ මාදිලිය ඇතුළු කර ඔබේ ප්‍රියතම මාධ්‍ය තෝරන්න.\nඔබට ඔබගේ අනෙකුත් උපාංගවලින් හෝ අන්තර්ජාලයෙන් පවතින ධාවන ලැයිස්තු සමමුහුර්ත කිරීමටද හැකිය.";

"EMPTY_PLAYLIST" = "හිස් ධාවන ලැයිස්තුව";
"EMPTY_PLAYLIST_DESCRIPTION" = "අදාළ කාණ්ඩවල සංස්කරණය කරන අතරතුර මාධ්‍ය එක් කරන්න.";

"EMPTY_HISTORY" = "හිස් ඉතිහාසය";
"EMPTY_HISTORY_DESCRIPTION" = "තවම මාධ්‍ය නැහැ.";

"EMPTY_MEDIA_LIST" = "Empty Media List";
"EMPTY_MEDIA_LIST_DESCRIPTION" = "The media list is empty therefore the playback could not start";

"PLAYBACK_SCRUB_HELP" = "ස්ක්‍රබ් කිරීමේ වේගය සීරුමාරු කිරීමට ඔබේ ඇඟිල්ල ඉහළට තල්ලු කරන්න.";
"PLAYBACK_SCRUB_HIGH" = "උච්ච-වේග ඇතිල්ලීම";
"PLAYBACK_SCRUB_HALF" = "අර්ධ-වේග ඇතිල්ලීම";
"PLAYBACK_SCRUB_QUARTER" = "කාර්තු-වේග ඇතිල්ලීම";
"PLAYBACK_SCRUB_FINE" = "සියුම් ඇතිල්ලීම";
"PLAYBACK_SCRUB_TOTAL_TIME_FORMAT" = "%@ elapsed, total duration %@"; /* 1: elapsed time, 2: total time */
"PLAYBACK_SCRUB_REMAINING_TIME_FORMAT" = "%@ elapsed, %@"; /* 1: elapsed time, 2: remaining time */
"PLAYBACK_SCRUB_ACCESSIBILITY_TIME_DISPLAY" = "Time Display";
"PLAYBACK_POSITION" = "පිළිවැයීම් ස්ථානය";
"VIDEO_FILTER" = "විදෘශ්‍ය පෙරහන්";
"VIDEO_FILTER_RESET_BUTTON" = "විදෘශ්‍ය පෙරහන් යළිසකසන්න";
"VIDEO_ASPECT_RATIO_BUTTON" = "වීඩියෝ දර්ශන අනුපාතය";
"BWD_BUTTON" = "පසුපසට පනින්න";
"FWD_BUTTON" = "ඉදිරියට පනින්න";
"PLAY_BUTTON" = "සෙල්ලම් කරන්න";
"NEXT_BUTTON" = "ඊළඟ";
"PREV_BUTTON" = "කලින්";
"PLAY_ALL_BUTTON" = "සියල්ල සෙල්ලම් කරන්න";
"PLAY_ALL_HINT" = "එකතුවේ ඇති සියලුම මාධ්‍ය වාදනය කරන්න";

"RESET_VIDEO_FILTERS" = "ඔබට වීඩියෝ පෙරහන් නැවත සැකසීමට අවශ්‍යද?";
"RESET_PLAYBACK_SPEED" = "ඔබට පසුධාවන වේගය නැවත සැකසීමට අවශ්‍යද?";
"RESET_EQUALIZER" = "ඔබට Equalizer හි සැකසුම් යළි සැකසීමට අවශ්‍යද?";
"RESET_SLEEP_TIMER" = "ඔබට නිද්‍රා ටයිමරය යළි සැකසීමට අවශ්‍යද?";

"CUSTOM_EQUALIZER_PROFILES" = "Custom profiles";
"DEFAULT_PROFILE_NAME" = "Custom profile";
"CUSTOM_EQUALIZER_ALERT_TITLE" = "Save new profile";
"CUSTOM_EQUALIZER_ALERT_MESSAGE" = "Do you want to save a new profile with the selected values?";
"RENAME_CUSTOM_PROFILE_TITLE" = "Rename the profile";
"DELETE_CUSTOM_PROFILE_TITLE" = "Delete the profile";
"DELETE_CUSTOM_PROFILE_MESSAGE" = "Do you want to delete the selected profile?";

"VERSION_FORMAT" = "අනුවාදය: %@";
"BASED_ON_FORMAT" = "පදනම් වේ:<br />%@";

"NEW" = "නව";

"VO_VIDEOPLAYER_TITLE" = "විදෘශ්‍ය වාදකය";
"VO_VIDEOPLAYER_DOUBLETAP" = "පිළිවැයීම් පාලක පෙන්වීමට හෝ සැඟවීමට දෙවරක් තට්ටු කරන්න";

"FIRST_STEPS_ITUNES" = "ගොනු සමමුහුර්තකරණය";
"FIRST_STEPS_ITUNES_TITLE" = "ඔබේ පරිගණකය සමඟ සමමුහුර්ත කරන්න";
"FIRST_STEPS_ITUNES_DETAILS" = "\"ගොනු බෙදාගැනීම\" සඳහා Finder හෝ iTunes භාවිතා කිරීමට ඔබගේ %@ සම්බන්ධ කරන්න. ගොනු මාරු කිරීමට VLC තෝරන්න.";
"FIRST_STEPS_WIFI_TITLE" = "Wi-Fi හරහා බෙදාගන්න";
"FIRST_STEPS_WIFI_DETAILS" = "Enter the generated URL in your favorite web browser while connected to the same network as your %@.";
"FIRST_STEPS_CLOUDS" = "වළාකුළු";
"FIRST_STEPS_CLOUD_TITLE" = "වලාකුළු";
"FIRST_STEPS_CLOUD_DETAILS" = "ඔබගේ මාධ්‍ය දුරස්ථව බාගැනීමට හෝ ප්‍රවාහ කිරීමට Google Drive හෝ Dropbox වැනි ක්ලවුඩ් සේවාවකට උඩුගත කරන්න.";

"PLEX_CHECK_ACCOUNT" = "සැකසීම් තුළ ඔබේ Plex ගිණුම පරීක්ෂා කරන්න";
"PLEX_ERROR_ACCOUNT" = "Plex පිවිසුම් දෝෂයකි";

"UNAUTHORIZED" = "අනවසර";

"SERVER" = "සේවාදායකය";
"SERVER_PORT" = "වරාය";
"NO_SERVER_FOUND" = "සේවාදායකයක් හමු නොවීය";
"NO_RECENT_STREAMS" = "මෑතකදී ප්‍රවාහයක් වාදනය නොවීය";

"WEBINTF_TITLE" = "Wi-Fi හරහා බෙදාගැනීම";
"WEBINTF_ETHERNET" = "ඊතර්නෙට් හරහා බෙදාගැනීම";
"WEBINTF_DROPFILES" = "ගොනු අතහරින්න";
"WEBINTF_DROPFILES_LONG" = "ගොනු ඔබේ %@වෙත එක් කිරීමට කවුළුව තුළට දමන්න.<br>හෝ ගොනු පිකර් සංවාදය භාවිතා කිරීමට \"+\" බොත්තම ක්ලික් කරන්න.";
"WEBINTF_DOWNLOADFILES" = "ගොනු බාගන්න";
"WEBINTF_DOWNLOADFILES_LONG" = "ඔබට ඔබගේ %@වෙතින් බාගත කිරීමට අවශ්‍ය ගොනුව ක්ලික් කරන්න.";
"WEBINTF_ADDRESS_COPIED" = "ලිපිනය පසුරු පුවරුවට පිටපත් කරන ලදී";
"WEBINTF_TITLE_ATV" = "දුරස්ථ නැවත ධාවනය";
"WEBINTF_DROPFILES_LONG_ATV" = "ගොනු ඔබේ %@මත වාදනය කිරීමට කවුළුව තුළට දමන්න.<br>හෝ ගොනු පිකර් සංවාදය භාවිතා කිරීමට \"+\" බොත්තම ක්ලික් කරන්න.";
"WEBINTF_URL_SENT" = "URL සාර්ථකව යවා ඇත.";
"WEBINTF_URL_EMPTY" = "URL හිස් විය නොහැක.";
"WEBINTF_URL_INVALID" = "වලංගු URL එකක් නොවේ.";
"WEBINTF_AUTH_REQUIRED" = "කරුණාකර ඔබ VLC iOS හි සැකසූ මුර කේතය ඇතුළත් කරන්න:";
"WEBINTF_AUTH_WRONG_PASSCODE" = "වැරදි මුර කේතය.<br>ඉතිරි උත්සාහයන්: ";
"WEBINTF_AUTH_BANNED" = "ඔබ වැරදි මුරකේත ඕනෑවට වඩා ඇතුළත් කර ඇත.<br>කරුණාකර VLC iOS නැවත ආරම්භ කර නැවත උත්සාහ කරන්න.";

"DURATION" = "කාල සීමාව";
"TITLE" = "ශීර්ෂය";
"ROTATE_BUTTON" = "Rotate"; /* Accessibility label for rotate button on the player */
"ROTATE_BUTTON_HINT" = "Toggles the video player between landscape and portrait mode."; /* Accessibility hint for rotate button on the player */

"AUDIO_INFO_VC_TITLE" = "ශ්රව්ය තොරතුරු";
"ENTER_URL" = "සෙල්ලම් කිරීමට URL ඇතුලත් කරන්න";
"HTTP_SERVER_ON" = "Remote Playback අක්‍රිය කරන්න";
"HTTP_SERVER_OFF" = "Remote Playback සබල කරන්න";
"CACHED_MEDIA" = "හැඹිලිගත මාධ්‍ය";
"CACHED_MEDIA_LONG" = "මෙහි පෙන්වා ඇති මාධ්‍ය ඔබේ Apple TV හි දේශීයව ගබඩා කර ඇත. ඔබගේ උපාංගයේ ගබඩාව අවසන් වුවහොත් VLC ක්‍රියාත්මක නොවන විට ඕනෑම වේලාවක පූර්ව දැනුම්දීමකින් තොරව මෙහෙයුම් පද්ධතිය මඟින් අන්තර්ගතය ඉවත් කළ හැකි බව සලකන්න.";
"DOWNLOAD_SUBS_FROM_OSO" = "Download Subtitles...";
"FOUND_SUBS" = "උපසිරැසි හමු විය";
"NO_SUB_FOUND_OSO" = "ඔබගේ මාධ්‍ය අයිතමය \"%@\" සඳහා උපසිරැසි හමු නොවිණි.";
"SELECT_AUDIO_FROM_FILES" = "බාහිර ශ්‍රව්‍ය පූරණය කරන්න...";
"SELECT_SUBTITLE_FROM_FILES" = "බාහිර උපසිරැසි පූරණය කරන්න...";
"USE_SPDIF" = "Pass-through භාවිතා කරන්න (S/PDIF)";

"PLAYBACK" = "නැවත ධාවනය";
"REPEAT_MODE" = "නැවත නැවත කරන්න";
"REPEAT_DISABLED" = "ආබාධිතයි";
"REPEAT_SINGLE" = "තනි";
"REPEAT_FOLDER" = "ෆෝල්ඩරය";
"SHUFFLE" = "කලවම් කරන්න";
"SHUFFLE_DISABLED" = "කලවම් කරන්න";

"RESET_NETWORK_STREAM_LIST_TITLE" = "ලැයිස්තුව යළි පිහිටුවන්න";
"RESET_NETWORK_STREAM_LIST_TEXT" = "මෑතකදී වාදනය කළ ජාල ප්‍රවාහ ලැයිස්තුව ස්ථිරව යළි පිහිටුවන්න.";

// MARK: - Local Network Service Names
"UPNP_LONG" = "Universal Plug'n'Play (UPnP)";
"UPNP_SHORT" = "UPnP";

"PLEX_LONG" = "Plex මාධ්‍ය සේවාදායකය (Bonjour හරහා)";
"PLEX_SHORT" = "ප්ලෙක්ස්";

"FTP_SHORT" = "FTP";
"SFTP_SHORT" = "SFTP";

"NFS_LONG" = "ජාල ගොනු පද්ධතිය (NFS)";
"NFS_SHORT" = "NFS";

"BONJOUR_FILE_SERVERS" = "BONJOUR ගොනු සේවාදායකය";
"DSM_WORKGROUP" = "වැඩ කණ්ඩායම";

"URL_NOT_SUPPORTED" = "URL එක විවෘත කළ නොහැක";

// Insert %@ where play-pause-glyph should be placed
"DELETE_ITEM_HINT" = "මකා දැමීමට %@ ඔබන්න"; /* Insert %@ where play-pause-glyph should be placed */
"DELETE_MESSAGE" = "තේරීම මකාදැමීම තහවුරු කරන්න";
"DELETE_MESSAGE_PLAYLIST" = "තෝරාගත් ධාවන ලැයිස්තුව මකා දැමීමට ඔබට විශ්වාසද?\nආශ්‍රිත මාධ්‍ය ගොනු මකා නොදමනු ඇත.";
"DELETE_MESSAGE_PLAYLIST_CONTENT" = "තෝරාගත් මාධ්‍ය ධාවන ලැයිස්තුවෙන් ඉවත් කිරීමට ඔබට විශ්වාසද?\nඒවා තැටියෙන් මකා නොදමනු ඇත.";

// MARK: - Drag and Drop

"PROTOCOL_NOT_SELECTED" = "ප්‍රොටෝකෝලය තෝරා නැත";
"Settings" = "සැකසුම්";

"ERROR" = "දෝෂයකි";
"SORT" = "වර්ග කරන්න";
"SORT_BY" = "අනුව තෝරන්න";
"SEARCH" = "සෙවීම";
"VIDEO" = "වීඩියෝ";

// MARK: - MediaViewController Swipable Header
"ALBUMS" = "ඇල්බම";
"ARTISTS" = "කලාකරුවන්";
"EPISODES" = "කථාංග";
"GENRES" = "ප්‍රභේද";
"ALL_VIDEOS" = "සියලුම වීඩියෝ";
"SONGS" = "ගීත";
"PLAYLISTS" = "ධාවන ලැයිස්තු";
"VIDEO_GROUPS" = "වීඩියෝ කණ්ඩායම්";
"HISTORY" = "ඉතිහාසය";
"MODIFIED_DATE" = "වෙනස් කළ දිනය";
"NAME" = "නම";

// MARK: - EDIT

"BUTTON_MENU" = "මෙනු";
"BUTTON_MENU_HINT" = "මෙම දර්ශනයේ ඇති මාධ්‍ය අයිතම තෝරන්න, නැවත අනුපිළිවෙලට සකසන්න";

"BUTTON_EDIT" = "සංස්කරණය කරන්න";
"BUTTON_EDIT_HINT" = "සංස්කරණ මාදිලිය";

"BUTTON_SELECT" = "තෝරන්න";
"BUTTON_SELECT_HINT" = "බොත්තම තෝරන්න";

"BUTTON_SELECT_ALL" = "සියල්ල තෝරන්න";
"BUTTON_SELECT_ALL_HINT" = "මෙම දර්ශනයේ ඇති සියලුම මාධ්‍ය අයිතම තෝරන්න";

"BUTTON_HISTORY" = "ඉතිහාසය";
"BUTTON_HISTORY_HINT" = "ඔබගේ මෑතකදී වාදනය කරන ලද මාධ්‍ය බලන්න";

"BUTTON_CLEAR" = "පැහැදිලිව";
"CLEAR_HISTORY_TITLE" = "ඉතිහාසය හිස් කරන්න";
"CLEAR_HISTORY_MESSAGE" = "හිස් කිරීමේ ඉතිහාසය තහවුරු කරන්න";

"ADD_TO_PLAYLIST" = "ධාවන ලැයිස්තුවට එක් කරන්න";
"ADD_TO_PLAYLIST_HINT" = "ධාවන ලැයිස්තුවට එකතු කිරීමේ මෙනුව විවෘත කරන්න";

"PLAY_AS_AUDIO" = "ශ්‍රව්‍ය ලෙස වාදනය කරන්න";
"PLAY_AS_AUDIO_HINT" = "වීඩියෝ ගොනුව ශ්‍රව්‍ය ගොනුවක් ලෙස වාදනය කරන්න.";

"PLAYLIST_PLACEHOLDER" = "ධාවන ලැයිස්තු මාතෘකාව";
"PLAYLIST_DESCRIPTION" = "ඔබගේ නව ධාවන ලැයිස්තුව සඳහා මාතෘකාවක් තෝරන්න";
"PLAYLIST_CREATION" = "නව ධාවන ලැයිස්තුවක් සාදන්න";
"PLAYLIST_CREATION_HINT" = "ධාවන ලැයිස්තුවක් සෑදීමට අන්තර්ක්‍රියාකාරී ක්‍රියාවක් පෙන්වන්න";
"ERROR_PLAYLIST_CREATION" = "ධාවන ලැයිස්තුවක් සෑදීමට අසමත් විය";
"ERROR_PLAYLIST_TRACKS" = "පීලි ලබා ගැනීමට අසමත් විය";

"ERROR_RENAME_FAILED" = "නැවත නම් කිරීම අසාර්ථක විය";
"ERROR_EMPTY_NAME" = "මාතෘකාව හිස් විය නොහැක";

"SHARE_LABEL" = "බෙදාගන්න";
"SHARE_HINT" = "තෝරාගත් ගොනු බෙදා ගන්න";
"RENAME_HINT" = "තෝරාගත් ගොනු නැවත නම් කරන්න";
"DELETE_HINT" = "තෝරාගත් ගොනු මකන්න";

"ADDITIONAL_OPTIONS" = "අමතර විකල්ප";

// MARK: - Sort

"BUTTON_SORT" = "වර්ග කරන්න";
"BUTTON_SORT_HINT" = "වර්ග කිරීමේ ක්‍රියා පත්‍රය පෙන්වන්න";
"HEADER_TITLE_SORT" = "අනුව තෝරන්න";
"DESCENDING_LABEL" = "අවරෝහණ අනුපිළිවෙල";
"DESCENDING_SWITCH_LABEL" = "ආරෝහණ හෝ අවරෝහණ අනුපිළිවෙල";
"DESCENDING_SWITCH_HINT" = "සන්දර්භය ආරෝහණ හෝ අවරෝහණ අනුපිළිවෙලින් සකසන්න";
"GRID_LAYOUT" = "ජාලකය";
"GRID_LAYOUT_HINT" = "අයිතම ජාලයක් ලෙස පෙන්වන්න";
"LIST_LAYOUT" = "ලැයිස්තුව";
"HIDE_FEAT_ARTISTS" = "දස්කම් සඟවන්න. කලාකරුවන්";
"HIDE_TRACK_NUMBERS" = "ධාවන අංක සඟවන්න";

// MARK: - VLCMediaLibraryKit - Sorting Criteria

"ALPHA" = "අක්ෂරාංක අනුව";
"DURATION" = "කාල සීමාව";
"INSERTION_DATE" = "ඇතුළත් කිරීමේ දිනය";
"LAST_MODIFICATION_DATE" = "අවසාන වෙනස් කිරීමේ දිනය";
"RELEASE_DATE" = "නිකුත් කරන දිනය";
"FILE_SIZE" = "ගොනු විශාලත්වය";
"ARTIST" = "කලාකරු";
"PLAY_COUNT" = "ක්‍රීඩා ගණන";
"ALBUM" = "ඇල්බමය";
"FILENAME" = "ගොනු නාමය";
"TRACK_NUMBER" = "සෙවුම් අංකය";
"NB_AUDIO" = "ශ්රව්ය සංඛ්යාව";
"NB_MEDIA" = "මාධ්ය සංඛ්යාව";
"NB_VIDEO" = "වීඩියෝ ගණන";
"NB_ALBUM" = "ඇල්බම ගණන";
"LAST_PLAYBACK_DATE" = "අවසන් නැවත ධාවනය දිනය";
"TRACK_ID" = "ධාවන හැඳුනුම්පත";
"CUSTOM" = "Custom";

// MARK: - VLCNetworkLoginTVViewController

"NO_SAVING_DATA" = "කිසිවක් සොයා ගත්තේ නැත";

// MARK: - MediaCollectionViewCell

"UNKNOWN_ARTIST" = "නොදන්නා කලාකරුවා";
"VARIOUS_ARTIST" = "විවිධ කලාකරුවන්";
"UNKNOWN_ALBUM" = "නොදන්නා ඇල්බමය";
"SINGLE_ITEM_SELECTED" = "අයිතමය තෝරා ඇත";
"MULTIPLE_ITEMS_SELECTED" = "තෝරාගත් අයිතම";

// MARK: - VideoPlayerControls

"SUBTITLE_AND_TRACK_BUTTON" = "උපසිරැසි සහ ශ්‍රව්‍ය පීලි";
"SUBTITLE_AND_TRACK_HINT" = "උපසිරැසි හෝ ශ්‍රව්‍ය පීලි තෝරන්න";

"DVD_BUTTON" = "DVD";
"DVD_HINT" = "DVD අතුරු මුහුණත";

"ROTATION_LOCK_BUTTON" = "භ්රමණ අගුල";
"ROTATION_LOCK_HINT" = "වත්මන් දිශානතියට වීඩියෝව අගුළු දමන්න";

"REPEAT_HINT" = "එකම මාධ්යය නැවත නැවත කරන්න";
"DO_NOT_REPEAT_HINT" = "මාධ්‍ය ලැයිස්තුව නැවත නොකරන්න";
"REPEAT_ALL_HINT" = "මාධ්‍ය ලැයිස්තුව නැවත කරන්න";

"BACKWARD_BUTTON" = "පසුපසට";
"BACKWARD_HINT" = "පසුපසට පනින්න";

"PREVIOUS_BUTTON" = "කලින්";
"PREVIOUS_HINT" = "පෙර මාධ්ය";

"PLAY_PAUSE_BUTTON" = "සෙල්ලම් කරන්න හෝ විරාම කරන්න";
"PLAY_PAUSE_HINT" = "වත්මන් පසුධාවනය වාදනය කරන්න හෝ විරාම කරන්න";

"STOP_BUTTON" = "නවත්වන්න";
"CLOSE_HINT" = "නැවත ධාවනය නවත්වන්න";

"MINIMIZE_BUTTON" = "අවම කරන්න";
"MINIMIZE_HINT" = "ක්රීඩකයා අවම කරන්න";

"NEXT_HINT" = "ඊළඟ මාධ්‍ය";

"FORWARD_BUTTON" = "ඉදිරියට";
"FORWARD_HINT" = "ඉදිරියට පනින්න";

"INTERFACE_LOCK_BUTTON" = "අතුරු මුහුණත අගුළු දමන්න";

"SELECT_A_MARK" = "Select the A mark";
"SELECT_A_MARK_HINT" = "Select the A mark of the AB loop";
"SELECT_B_MARK" = "Select the B mark";
"SELECT_B_MARK_HINT" = "Select the B mark of the AB loop";

"AB_LOOP" = "A→B ලූපය";
"AB_LOOP_MARKS" = "A→B ලූප් ලකුණු";

"RESET_AB_LOOP" = "ඔබට A→B ලූපය ඉවත් කිරීමට අවශ්‍යද?";
"RESET_AB_LOOP_MARKS" = "ඔබට A→B ලූප ලකුණු නැවත සැකසීමට අවශ්‍යද?";

"SHUFFLE_HINT" = "මාධ්‍ය ලැයිස්තුව කලවම් කරන්න";
"SHUFFLE_OFF_HINT" = "මාධ්‍ය ලැයිස්තුව මාරු නොකරන්න";

"ASPECT_RATIO_TITLE" = "දර්ශන අනුපාත";
"VIDEO_ASPECT_RATIO_BUTTON" = "වීඩියෝ දර්ශන අනුපාතය";
"VIDEO_ASPECT_RATIO_HINT" = "වත්මන් වීඩියෝවේ දර්ශන අනුපාතය වෙනස් කරන්න";

"MORE_OPTIONS_BUTTON" = "තව";
"MORE_OPTIONS_HINT" = "තවත් විකල්ප පාලන බලන්න";

"PLAYBACK_CONTROLS_BAR_TITLE" = "Playback controls";
"PLAYBACK_CONTROLS_BAR_HINT" = "Pause, seek, next chapter";

"PLAYER_WARNING_SUBTITLE_CAST_TITLE" = "උපසිරැසි සඳහා සහය නොදක්වයි";
"PLAYER_WARNING_SUBTITLE_CAST_DESCRIPTION" = "විකාශනය කරන අතරතුර උපසිරැසි තවමත් සහාය නොදක්වයි.";

// MARK: - MediaMoreOptionsActionSheet
"EQUALIZER_CELL_TITLE" = "සමකරනය";
"MORE_OPTIONS_HEADER_TITLE" = "වීඩියෝ විකල්ප";
"MORE_OPTIONS_HEADER_AUDIO_TITLE" = "ශ්රව්ය විකල්ප";
"BOOKMARKS_TITLE" = "පිටු සලකුණු";
"ADD_BOOKMARKS_TITLE" = "පිටු සලකුණු එකතු කරන්න";
"BOOKMARK_DEFAULT_NAME" = "පිටු සලකුණු කරන්න";
"BOOKMARK_RENAME_TITLE" = "පිටු සලකුණ නැවත නම් කරන්න";
"BOOKMARK_DELETE_TITLE" = "පිටු සලකුණ මකන්න";
"BOOKMARK_DELETE_MESSAGE" = "පිටු සලකුණ මකාදැමීම තහවුරු කරන්න";
"INCREASE_BUTTON" = "වැඩි කිරීමේ බොත්තම";
"INCREASE_PLAYBACK_SPEED" = "නැවත ධාවනය කිරීමේ වේගය වැඩි කරන්න";
"INCREASE_AUDIO_DELAY" = "ශ්‍රව්‍ය ප්‍රමාදය වැඩි කරන්න";
"INCREASE_SUBTITLES_DELAY" = "උපසිරැසි ප්‍රමාදය වැඩි කරන්න";
"DECREASE_BUTTON" = "බොත්තම අඩු කරන්න";
"DECREASE_PLAYBACK_SPEED" = "නැවත ධාවනය කිරීමේ වේගය අඩු කරන්න";
"DECREASE_AUDIO_DELAY" = "ශ්‍රව්‍ය ප්‍රමාදය අඩු කරන්න";
"DECREASE_SUBTITLES_DELAY" = "උපසිරැසි ප්‍රමාදය අඩු කරන්න";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT" = "නැවත ධාවනය වේග කෙටිමඟ පෙන්වන්න";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT_HINT" = "පසුධාවන වේග කෙටිමඟ සංදර්ශන කිරීමට සබල කරන්න";
"VIDEO_FILTERS_HINT" = "වීඩියෝ පෙරහන් දසුන විවෘත කිරීමට තෝරන්න";
"PLAYBACK_SPEED_HINT" = "නැවත ධාවනය වේග දසුන විවෘත කිරීමට තෝරන්න";
"SUBTITLES_DELAY_HINT" = "උපසිරැසි ප්‍රමාද දසුන විවෘත කිරීමට තෝරන්න";
"AUDIO_DELAY_HINT" = "ශ්‍රව්‍ය ප්‍රමාද දසුන විවෘත කිරීමට තෝරන්න";
"SLEEP_TIMER_HINT" = "නින්ද ටයිමර් දසුන විවෘත කිරීමට තෝරන්න";
"EQUALIZER_HINT" = "සමකරන දසුන විවෘත කිරීමට තෝරන්න";
"CHAPTERS_HINT" = "පරිච්ඡේද දර්ශනය විවෘත කිරීමට තෝරන්න";
"BOOKMARKS_HINT" = "පිටුසන් දසුන විවෘත කිරීමට තෝරන්න";
"INTERFACE_LOCK_HINT" = "පරිශීලක අතුරුමුහුණත අගුළු දැමීමේ විකල්පය සක්රිය කරන්න";

// MARK: - Settings
"FORCE_RESCAN_TITLE" = "බල මාධ්‍ය පුස්තකාලය නැවත පරිලෝකනය කරන්න";
"FORCE_RESCAN_MESSAGE" = "ඔබේ මාධ්‍ය පුස්තකාලය නැවත පරිලෝකනය කිරීමට VLC හට බල කිරීමට ඔබට අවශ්‍යද?\nඑය යම් කාලයක් ගත විය හැක.";

"FEEDBACK_EMAIL_TITLE" = "iOS සහ iPad මත VLC පිළිබඳ ප්‍රතිපෝෂණ";
"FEEDBACK_EMAIL_NOT_POSSIBLE_TITLE" = "තැපැල් ගිණුම වින්‍යාස කර නැත";
"FEEDBACK_EMAIL_NOT_POSSIBLE_LONG" = "වෙනත් උපාංගයකින් %@ හරහා අප අමතන්න.";

"SETTINGS_THEME_BLACK" = "අඳුරු මාදිලියේ කළු පසුබිම භාවිතා කරන්න";
"SETTINGS_THEME_BLACK_SUBTITLE" = "OLED තිරයක් සහිත උපාංගවල බැටරි ආයු කාලය වැඩි දියුණු කරයි";

"SETTINGS_RESET_TITLE" = "සැකසුම් නැවත සකසන්න";
"SETTINGS_RESET_MESSAGE" = "ඔබට සියලු සැකසීම් ඒවායේ පෙරනිමි අගයන් වෙත යළි පිහිටුවීමට අවශ්‍යද?";

"SETTINGS_PLAY_ALL" = "එකතු කිරීම් සඳහා බාධාවකින් තොරව නැවත ධාවනය";
"SETTINGS_PLAY_ALL_HINT" = "ශ්‍රව්‍ය හෝ දෘශ්‍ය ටැබ් තුළ මීළඟ මාධ්‍ය ස්වයංක්‍රීයව වාදනය කිරීමට සබල කරන්න";
"SETTINGS_PLAYLIST_PLAY_ALL" = "ධාවන ලැයිස්තු සඳහා බාධාවකින් තොරව නැවත ධාවනය";
"SETTINGS_PLAYLIST_PLAY_ALL_HINT" = "ධාවන ලැයිස්තුවක මීළඟ මාධ්‍ය ස්වයංක්‍රීයව වාදනය කිරීමට සබල කරන්න";

"SETTINGS_DOCUMENTATION" = "ලේඛනගත කිරීම";

// MARK: - Local Network

"SMBV1_WARN_TITLE" = "SMBv1 සම්බන්ධතා අනතුරු ඇඟවීම";
"SMBV1_WARN_DESCRIPTION" = "අපි පැරණි ප්‍රොටෝකෝලයක් (SMBv1) අනාවරණය කර ගත්තෙමු.\nSMBv1 සමඟ දිගටම කරගෙන යාමට ඔබට විශ්වාසද?\nඅපි ඔබගේ සේවාදායක සැකසුම් උත්ශ්‍රේණි කිරීමට හෝ වෙනස් කිරීමට උපදෙස් දෙන්නෙමු.";
"SMBV1_CONTINUE" = "SMBv1 සමඟින් ඉදිරියට යන්න";
"SMBV1_NEXT_PROTOCOL" = "SMBv2/v3 උත්සාහ කරන්න";

// MARK: - Preview labels

"ENCODING" = "කේතනය කිරීම";

// MARK: - Media groups

"ADD_TO_MEDIA_GROUP" = "මාධ්‍ය සමූහයට එක් කරන්න";
"ADD_TO_MEDIA_GROUP_HINT" = "මාධ්‍ය කණ්ඩායම් වෙත එකතු කිරීමේ මෙනුව විවෘත කරන්න";

"MEDIA_GROUPS" = "මාධ්ය කණ්ඩායම්";
"MEDIA_GROUPS_DESCRIPTION" = "ඔබේ නව මාධ්‍ය කණ්ඩායම සඳහා මාතෘකාවක් තෝරන්න";
"MEDIA_GROUPS_PLACEHOLDER" = "මාධ්‍ය කණ්ඩායම් මාතෘකාව";

"REMOVE_FROM_MEDIA_GROUP" = "මාධ්‍ය සමූහයෙන් ඉවත් කරන්න";
"REMOVE_FROM_MEDIA_GROUP_HINT" = "මාධ්‍ය සමූහයෙන් තේරීම ඉවත් කරන්න";

"MEDIA_GROUP_CREATION" = "නව මාධ්‍ය කණ්ඩායම";
"MEDIA_GROUP_CREATION_HINT" = "ධාවන ලැයිස්තුවක් සෑදීමට ඇඟවීම් පෙන්වන්න";
"MEDIA_GROUP_MOVE_TO_ROOT" = "අන්තර්ගතය ඉහළ මට්ටමට ගෙන යන්න";
"MEDIA_GROUP_MOVE_TO_ROOT_HINT" = "තේරීමේ අන්තර්ගතය ඉහළ මට්ටමට ගෙන යයි";

"BUTTON_REGROUP" = "නැවත සමූහගත කරන්න";
"BUTTON_REGROUP_TITLE" = "නැවත කණ්ඩායම් තේරීම";
"BUTTON_REGROUP_HINT" = "තනි මාධ්‍ය ස්වයංක්‍රීයව නැවත සමූහගත කිරීමට උත්සාහ කරන්න.";
"BUTTON_REGROUP_DESCRIPTION" = "තනි මාධ්‍ය ස්වයංක්‍රීයව නැවත සමූහගත කිරීමට උත්සාහ කිරීමට ඔබට විශ්වාසද?\nමෙයට යම් කාලයක් ගත විය හැක.";

// MARK: - Files.app persistence file
"MEDIALIBRARY_FILES_PLACEHOLDER" = "ඒවා එක් කිරීමට මාධ්‍ය මෙහි තබන්න";
"MEDIALIBRARY_ADDING_PLACEHOLDER" = "එකතු කරමින්...";

// MARK: - QueueViewController

"PLAY_HINT" = "සෙල්ලම් කරන්න";
"PLAY_LABEL" = "සෙල්ලම් කරන්න";
"PLAY_NEXT_IN_QUEUE_HINT" = "පෝලිමේ ඊළඟට සෙල්ලම් කරන්න";
"PLAY_NEXT_IN_QUEUE_LABEL" = "පෝලිමේ ඊළඟට සෙල්ලම් කරන්න";
"APPEND_TO_QUEUE_HINT" = "පෝලිමට එකතු කරන්න";
"APPEND_TO_QUEUE_LABEL" = "පෝලිමට එකතු කරන්න";
"QUEUE_LABEL" = "Queue";

"DISPLAY_AS" = "ලෙස සංදර්ශන කරන්න";

/* New strings */
"BRIGHTNESS_HINT" = "සිරස් දීප්තිය පාලනය";
"BRIGHTNESS_SLIDER" = "දීප්තියේ මට්ටම වෙනස් කිරීමට සිරස් අතට ලිස්සා යන්න";

/* New strings */
"VOLUME_HINT" = "සිරස් පරිමාව පාලනය";
"VOLUME_SLIDER" = "ශබ්ද මට්ටම වෙනස් කිරීමට සිරස් අතට ලිස්සා යන්න";

// MARK: - AudioMiniPlayer playback controls menu
"MENU_PLAYBACK_CONTROLS" = "පසුධාවන පාලන";
"MENU_REPEAT_DISABLED" = "නැවත නොකරන්න";
"MENU_REPEAT_SINGLE" = "එකක් නැවත කරන්න";
"MENU_REPEAT_ALL" = "සියල්ල නැවත කරන්න";

// MARK: - ActionSheet

"ACTIONSHEET_BACKGROUND_LABEL" = "ක්රියාකාරී පත්රිකා පසුබිම";
"ACTIONSHEET_BACKGROUND_HINT" = "ක්‍රියා පත්‍රය ඉවත් කිරීමට තට්ටු කරන්න.";

// MARK: - Donation
"DONATION_CUSTOM_AMOUNT" = "අභිරුචි මුදල ඇතුළත් කරන්න";
"DONATION_TITLE" = "ලාභයට වඩා පෞද්ගලිකත්වය";
"DONATION_DESCRIPTION" = "ඔබ විසින් අරමුදල් සපයනු ලබන පුද්ගලික, විවෘත මූලාශ්‍ර බහුමාධ්‍ය. දැන්වීම් නැත, ලුහුබැඳීම් නැත, සම්මුතියක් නැත. සෑම කෙනෙකුටම භාවිතා කිරීමට නොමිලේ. VideoLAN සඳහා සහය වීමට දැන් පරිත්‍යාග කරන්න.";
"DONATION_WINDOW_TITLE" = "VideoLAN වෙත පරිත්‍යාගයක් කරන්න";
"DONATE_CC_DC" = "ක්‍රෙඩිට් හෝ ඩෙබිට් කාඩ්";
"DONATION_CHOOSE_PP" = "කරුණාකර ඔබේ ගෙවීම් සපයන්නා තෝරන්න";
"DONATION_CHOOSE_CURRENCY" = "කරුණාකර මුදල් වර්ගයක් තෝරන්න";
"DONATION_AMOUNT" = "පරිත්‍යාග මුදල: %@";
"DONATION_CC_NUM" = "ණයවර පත් අංකය";
"DONATION_CC_EXPIRY_DATE" = "කල්පිරෙන දිනය";
"DONATION_CC_EXPIRY_DATE_MONTH" = "එම්.එම්";
"DONATION_CC_EXPIRY_DATE_YEAR" = "YY";
"DONATION_CC_CVV" = "CVV";
"DONATION_APPLE_PAY_NOT_POSSIBLE" = "Apple Pay වින්‍යාස කිරීම අසාර්ථක වීම";
"DONATION_APPLE_PAY_NOT_POSSIBLE_LONG" = "VLC ඔබේ පරිත්‍යාගය සිදු කිරීමට Apple Pay වින්‍යාස කිරීමට අසමත් විය. කරුණාකර ඉදිරියට යාමට වෙනත් ගෙවීම් සපයන්නෙකු තෝරන්න.";
"DONATION_DONATE_BUTTON" = "පරිත්‍යාග කරන්න";
"PURCHASE_FAILED" = "මිලදී ගැනීම අසාර්ථක විය.";
"SEND_DONATION" = "ඔබේ පරිත්‍යාගය එවන්න";
"PURCHASE_SUCESS_TITLE" = "පරිත්‍යාග යැව්වා";
"PURCHASE_SUCESS_DESCRIPTION" = "ඔබගේ පරිත්‍යාගයට ස්තූතියි!";
"DONATION_CONTINUE" = "දිගටම කරගෙන යන්න";
"BUTTON_NOT_NOW" = "Not now";
"DONATION_NAGSCREEN_TITLE" = "Donate today";
"DONATION_NAGSCREEN_SUBTITLE" = "Support free and open source multimedia";
"DONATION_INVOICES" = "Invoices";
"DONATION_RECEIPTS" = "Receipts";
"DONATION_INVOICES_RECEIPTS" = "Invoices & Receipts";
"DONATION_CHARGES_CLEARED_ON_REINSTALL" = "If you have reinstalled VLC, invoices or receipts from previous donations will not be available as all your personal information is stored on this device only.\n\nIf you have any questions, contact us at donation@videolan.org and mention this anonymous user ID: %@";
"DONATION_CANCEL_MONTHLY" = "Cancel Regular Donation";
"DONATION_MONTHLY" = "Monthly";
"DONATION_MONTHLY_FORMAT" = "%@/month";
"DONATION_MONTHLY_VIDEOLAN" = "Monthly Donation to VideoLAN";
"DONATION_ONCE" = "One-Time";
"DONATION_UPDATE_MONTHLY" = "Update Regular Donation";
"DONATION_VIDEOLAN" = "Donation to VideoLAN";
"DONATION_CANCEL_LONG" = "We are sad to see you cancelling the regular monthly donations to VideoLAN. Your previous support means a lot to us. Thank you so much!";
"DONATION_BANK_TRANSFER" = "Bank Transfer";
"DONATION_BANK_TRANSFER_LONG" = "Stripe processes donations made to VideoLAN. VideoLAN does not store or collect your personal information.";
"DONATION_BUTTON_AGREE" = "Agree";
"DONATION_IBAN" = "Bank Account Number (IBAN)";
"DONATION_EMAIL" = "Email";
"DONATION_NAME" = "Name";
"DONATION_NAME_BANK_ACCOUNT" = "Name on Bank Account";
"DONATION_EMBARGOED_COUNTRY" = "We currently cannot accept donations in your country. Enjoy VLC!";

// MARK: - Playback keyboard shortcuts

"KEY_JUMP_BACKWARDS" = "පසුපසට පනින්න";
"KEY_JUMP_FORWARDS" = "ඉදිරියට පනින්න";
"KEY_INCREASE_PLAYBACK_SPEED" = "නැවත ධාවනය කිරීමේ වේගය වැඩි කරන්න";
"KEY_DECREASE_PLAYBACK_SPEED" = "පසුධාවන වේගය අඩු කරන්න";
"KEY_RESET_PLAYBACK_SPEED" = "නැවත ධාවනය වේගය නැවත සකසන්න";
"KEY_SEEK_TO_PERCENT" = "Seek to %i%% of duration";

// MARK: - TitleSelection

"TITLESELECTION_BACKGROUND_LABEL" = "මාතෘකා තේරීමේ පසුබිම";
"TITLESELECTION_BACKGROUND_HINT" = "දසුන ඉවත් කිරීමට තට්ටු කරන්න.";

// MARK: - NEW DELETE STRINGS
"DELETE_SINGLE_TITLE" = "\"%@\" මකන්නද?";
"DELETE_MULTIPLE_TITLE" = "\"%@\" සහ %d අනෙකුත් ඒවා මකන්නද?";

// MARK: - AppIntent Strings
"APPINTENT_PLAY_MEDIA_TITLE" = "Play in the background";
"APPINTENT_PLAY_MEDIA_DESCRIPTION" = "Play the selected playlist in the background without opening the app.";
"APPINTENT_PLAY_MEDIA_PLAY_${mediaName}" = "Play ${mediaName} in the background";

// MARK: - VerticalSliderControl Strings
"VERTICAL_SLIDER_CONTROL_ACCESSIBILITY_LABEL" = "Vertical slider";
"VERTICAL_SLIDER_CONTROL_INCREMENT_ACTION" = "Increment";
"VERTICAL_SLIDER_CONTROL_DECREMENT_ACTION" = "Decrement";

// MARK: - Download Completion Announcement
"DOWNLOAD_COMPLETED_ANNOUNCEMENT" = "Downloading file \"%@\" completed";

//MARK: - Playlist Add Action Status
"ADD_TO_PLAYLIST_STATUS_MESSAGE" = "Added %d media to %@";
"ADD_ALERT_TITLE" = "Selection found in playlist";
"ADD_ALERT_MESSAGE_SINGLE" = "You are trying to add a media that is already part of %@";
"ADD_ALERT_MESSAGE_MULTIPLE" = "You are trying to add %d media that are already part of %@";

//MARK: - Last played playlist indicator
"LAST_PLAYED_PLAYLIST_LABEL_TITLE" = "Last Played";
